# -*- coding: utf-8 -*-
#
# Sorry, the comments are all in Chinese because this project highly relies on Chinese Language.
#
# 词库
#

SINGLE = lambda:{"c_lim": 1, "w_end": 0} # 只做定语，最多选一个
DOUBLE = lambda:{"c_lim": 2, "w_end": 0} # 只做定语，最多选两个
ONLYEND = lambda:{"w_attr": 0} # 只能用作中心词

wordslist=({}, [
	(SINGLE(), [u"新制", u"陈酿"]),
	(SINGLE(), [u"无水", u"注水"]),
	(SINGLE(), [u"公共", u"私人"]),
	(SINGLE(), [u"廉价", u"免费"]),
	(SINGLE(), [u"劣质", u"优质"]),
	(SINGLE(), [u"寒酸", u"豪华"]),
	(SINGLE(), [u"增肥", u"减肥"]),
	(SINGLE(), [u"避孕", u"绝育"]),
	(SINGLE(), [u"柴油", u"核动力"]),
	(SINGLE(), [u"革命", u"反革命"]),
	(SINGLE(), [u"量子", u"相对论"]),
	(SINGLE(), [u"免税", u"免月租"]),
	(SINGLE(), [u"反科学", u"反重力"]),
	(SINGLE(), [u"紫外", u"红外", u"激光"]),
	(SINGLE(), [u"土家", u"维吾尔", u"蒙古"]),
	(SINGLE(), [u"无烟", u"无尘", u"节能", u"环保"]),
	(SINGLE(), [u"东部", u"西部", u"南部", u"北部"]),
	(SINGLE(), [u"爱国", u"卖国", u"叛国", u"通敌"]),
	(SINGLE(), [u"美白", u"排毒养颜", u"红润", u"亮白"]),
	(SINGLE(), [u"微型", u"大型", u"大规模", u"超大规模"]),
	(SINGLE(), [u"集成电路", u"电子", u"晶体管", u"真空管"]),
	(SINGLE(), [u"五香", u"红烧", u"糖醋", u"香酱", u"高汤", u"孜然", u"爆炒", u"红焖", u"清蒸"]),
	(SINGLE(), [u"乌干达", u"肯尼亚", u"中非", u"东非", u"坦桑尼亚", u"埃塞俄比亚", u"索马里", u"阿富汗", u"伊拉克", u"津巴布韦"]),
	(SINGLE(), [u"资本主义", u"社会主义", u"共产主义", u"无政府主义", u"自治主义", u"自由主义", u"军国主义", u"帝国主义", u"专制主义"]),
	
	(DOUBLE(), [u"超级", u"加强", u"无敌", u"终极"]),
	(DOUBLE(), [u"艾滋", u"天花", u"非典", u"流感", u"瘟疫", u"梅毒"]),
	(DOUBLE(), [u"红木", u"玻璃", u"钢筋混凝土", u"烂泥", u"红砖", u"水泥", u"白金", u"黄金", u"红壤", u"黑土"]),
	
	({"w_attr": -1, "w_end": 0}, [u"防臭", u"防水", u"防洪", u"防火", u"抗震", u"抗旱", u"防盗"]),
	({"w_attr": -1, "w_end": 0}, [u"有奖", u"深海", u"安全", u"解放", u"红头", u"新华", u"双卡", u"太空", u"拆迁", u"自首", u"加长", u"大头", u"现代", u"全能", u"新编", u"井冈山", u"军用", u"转基因", u"北大荒", u"经全国中小学教材审定委员会2004年初审通过普通高中课程标准实验", u"高保真", u"除虫", u"辟邪", u"二手", u"一次性", u"放心", u"反恐", u"维和", u"流窜", u"大棚", u"无证", u"流动", u"可食用", u"微波炉适用", u"抢险", u"爱心"]),
	
	(ONLYEND(), [u"芭比娃娃"]),
	(ONLYEND(), [u"校长", u"班长"]),
	(ONLYEND(), [u"告家长书", u"请假条"]),
	(ONLYEND(), [u"海洛因", u"吗啡", u"鸦片", u"大麻"]),
	(ONLYEND(), [u"平原", u"高原", u"盆地", u"山地", u"丘陵"]),
	(ONLYEND(), [u"大饼", u"豆浆", u"油条", u"馄饨", u"土豆"]),
	(ONLYEND(), [u"知府", u"知县", u"总督", u"巡抚", u"节度使"]),
	(ONLYEND(), [u"老虎凳", u"铁处女", u"十字架", u"断头台", u"电椅"]),
	(ONLYEND(), [u"省长", u"市长", u"区长", u"县长", u"乡长", u"镇长"]),
	(ONLYEND(), [u"羟基", u"羧基", u"氨基", u"羰基", u"酮基", u"酰胺基"]),
	(ONLYEND(), [u"教堂", u"厕所", u"教室", u"图书馆", u"体育场", u"核电站"]),
	(ONLYEND(), [u"天平", u"离心机", u"加速器", u"移液管", u"注射器", u"试管"]),
	(ONLYEND(), [u"股长", u"科长", u"处长", u"司长", u"局长", u"厅长", u"部长"]),
	(ONLYEND(), [u"二锅头", u"XO", u"干红", u"汾酒", u"白酒", u"黄酒", u"茅台"]),
	(ONLYEND(), [u"平底锅", u"电饭煲", u"微波炉", u"高压锅", u"热水壶", u"马桶"]),
	(ONLYEND(), [u"司令", u"军长", u"师长", u"旅长", u"团长", u"营长", u"连长", u"排长"]),
	(ONLYEND(), [u"僵尸", u"蜘蛛侠", u"超人", u"奥特曼", u"天仙宝宝", u"皮卡丘", u"黑猫警长", u"奥特曼"]),
	(ONLYEND(), [u"苍蝇", u"蚊子", u"老虎", u"狮子", u"袋鼠", u"熊猫", u"黄鼠狼", u"藏獒", u"蜘蛛", u"黄狗", u"黑猫"]),
	(ONLYEND(), [u"老师", u"住持", u"和尚", u"尼姑", u"小丑", u"理发师", u"剃头家", u"太监", u"飞行员", u"精神病爱好者"]),
	(ONLYEND(), [u"爸爸", u"妈妈", u"爷爷", u"奶奶", u"哥哥", u"姐姐", u"弟弟", u"妹妹", u"儿子", u"孙子", u"老婆", u"老公", u"后妈", u"继父"]),
	(ONLYEND(), [u"下士", u"中士", u"上士", u"军事长", u"学员", u"准尉", u"少尉", u"中尉", u"上尉", u"大尉", u"少校", u"中校", u"上校", u"大校", u"准将", u"少将", u"中将", u"上将", u"大将", u"元帅"]),
	
	({"end": u"栓"}, [u"消防"]),
	({"end": u"器"}, [u"吸尘", u"坐便"]),
	({"end": u"车"}, [u"手推", u"购物", u"婴儿", u"摩托", u"三轮", u"皮卡"]),
	({"end": u"厂"}, [u"造币", u"发电", u"砖瓦", u"火柴", u"瓷砖", u"锅炉", u"炼油", u"电机", u"制片", u"制药", u"化工"]),
	({"end": u"机"}, [u"剃头", u"打火", u"打鼾", u"洗衣", u"电视", u"蒸汽", u"缝纫", u"收音", u"录音", u"计算", u"学习", u"点读", u"饮水"]),
	
	({"end": u"鞋", "w_attr": 0}, [u"草", u"布", u"拖"]),
	({"end": u"裤", "w_attr": 0}, [u"内", u"棉毛", u"牛仔"]),
	
	({"c_lim": 1}, [u"左撇子", u"右利手"]),
	
	({"w_attr": -1, "w_end": -1}, [u"儿童", u"人民", u"首长", u"黑户", u"文盲", u"流氓", u"贫民窟", u"知识分子"]),
	({"w_attr": 0, "w_end": -1}, [u"屁", u"卫星", u"手套", u"半仙", u"狗屎", u"饲料", u"花炮", u"摊位", u"坟墓", u"鞋垫", u"粪池", u"游击队", u"曲辕犁", u"热水袋", u"原子弹", u"下水沟", u"热得快"])
])
