# -*- coding: utf-8 -*-
#
# Sorry, the comments are all in Chinese because this project highly relies on Chinese Language.
#
# 词库
#

SINGLE = lambda:{"c_lim": 1, "w_end": 0} # 只做定语，最多选一个
DOUBLE = lambda:{"c_lim": 2, "w_end": 0} # 只做定语，最多选两个
ONLYEND = lambda:{"w_attr": 0} # 只能用作中心词

wordslist=({}, [
	(SINGLE(), ["无水", "注水"]),
	(SINGLE(), ["公共", "私人"]),
	(SINGLE(), ["廉价", "免费"]),
	(SINGLE(), ["劣质", "优质"]),
	(SINGLE(), ["寒酸", "豪华"]),
	(SINGLE(), ["增肥", "减肥"]),
	(SINGLE(), ["避孕", "绝育"]),
	(SINGLE(), ["柴油", "核动力"]),
	(SINGLE(), ["革命", "反革命"]),
	(SINGLE(), ["量子", "相对论"]),
	(SINGLE(), ["免税", "免月租"]),
	(SINGLE(), ["反科学", "反重力"]),
	(SINGLE(), ["紫外", "红外", "激光"]),
	(SINGLE(), ["土家", "维吾尔", "蒙古"]),
	(SINGLE(), ["无烟", "无尘", "节能", "环保"]),
	(SINGLE(), ["东部", "西部", "南部", "北部"]),
	(SINGLE(), ["爱国", "卖国", "叛国", "通敌"]),
	(SINGLE(), ["美白", "排毒养颜", "红润", "亮白"]),
	(SINGLE(), ["微型", "大型", "大规模", "超大规模"]),
	(SINGLE(), ["集成电路", "电子", "晶体管", "真空管"]),
	(SINGLE(), ["五香", "红烧", "糖醋", "香酱", "高汤", "孜然", "爆炒", "红焖", "清蒸"]),
	(SINGLE(), ["乌干达", "肯尼亚", "中非", "东非", "坦桑尼亚", "埃塞俄比亚", "索马里", "阿富汗", "伊拉克", "津巴布韦"]),
	
	(DOUBLE(), ["超级", "加强", "无敌", "终极"]),
	(DOUBLE(), ["艾滋", "天花", "非典", "流感", "瘟疫", "梅毒"]),
	(DOUBLE(), ["红木", "玻璃", "钢筋混凝土", "烂泥", "红砖", "水泥", "白金", "黄金", "红壤", "黑土"]),
	
	({"w_attr": -1, "w_end": 0,}, ["有奖", "深海", "安全", "解放", "红头", "新华", "双卡", "太空", "拆迁", "自首", "加长", "大头", "现代", "全能", "新编", "井冈山", "军用", "转基因", "北大荒", "经全国中小学教材审定委员会2004年初审通过普通高中课程标准实验"]),
	
	(ONLYEND(), ["芭比娃娃"]),
	(ONLYEND(), ["校长", "班长"]),
	(ONLYEND(), ["告家长书", "请假条"]),
	(ONLYEND(), ["海洛因", "吗啡", "鸦片", "大麻"]),
	(ONLYEND(), ["平原", "高原", "盆地", "山地", "丘陵"]),
	(ONLYEND(), ["大饼", "豆浆", "油条", "馄饨", "土豆"]),
	(ONLYEND(), ["知府", "知县", "总督", "巡抚", "节度使"]),
	(ONLYEND(), ["老虎凳", "铁处女", "十字架", "断头台", "电椅"]),
	(ONLYEND(), ["省长", "市长", "区长", "县长", "乡长", "镇长"]),
	(ONLYEND(), ["羟基", "羧基", "氨基", "羰基", "酮基", "酰胺基"]),
	(ONLYEND(), ["教堂", "厕所", "教室", "图书馆", "体育场", "核电站"]),
	(ONLYEND(), ["天平", "离心机", "加速器", "移液管", "注射器", "试管"]),
	(ONLYEND(), ["股长", "科长", "处长", "司长", "局长", "厅长", "部长"]),
	(ONLYEND(), ["二锅头", "XO", "干红", "汾酒", "白酒", "黄酒", "茅台"]),
	(ONLYEND(), ["平底锅", "电饭煲", "微波炉", "高压锅", "热水壶", "马桶"]),
	(ONLYEND(), ["司令", "军长", "师长", "旅长", "团长", "营长", "连长", "排长"]),
	(ONLYEND(), ["僵尸", "蜘蛛侠", "超人", "奥特曼", "天仙宝宝", "皮卡丘", "黑猫警长", "奥特曼"]),
	(ONLYEND(), ["苍蝇", "蚊子", "老虎", "狮子", "袋鼠", "熊猫", "黄鼠狼", "藏獒", "蜘蛛", "黄狗", "黑猫"]),
	(ONLYEND(), ["老师", "住持", "和尚", "尼姑", "小丑", "理发师", "剃头家", "太监", "飞行员", "精神病爱好者"]),
	(ONLYEND(), ["爸爸", "妈妈", "爷爷", "奶奶", "哥哥", "姐姐", "弟弟", "妹妹", "儿子", "孙子", "老婆", "老公", "后妈", "继父"]),
	(ONLYEND(), ["下士", "中士", "上士", "军事长", "学员", "准尉", "少尉", "中尉", "上尉", "大尉", "少校", "中校", "上校", "大校", "准将", "少将", "中将", "上将", "大将", "元帅"]),
	
	({"end":"器"}, ["吸尘", "坐便"]),
	({"end":"车"}, ["手推", "购物", "婴儿", "摩托", "三轮", "皮卡"]),
	({"end":"厂"}, ["造币", "发电", "砖瓦", "火柴", "瓷砖", "锅炉", "炼油", "电机", "制片", "制药", "化工"]),
	({"end":"机"}, ["剃头", "打火", "打鼾", "洗衣", "电视", "蒸汽", "缝纫", "收音", "录音", "计算", "学习", "点读", "饮水"]),
	
	({"c_lim": 1}, ["左撇子", "右利手"]),
	
	({"w_attr": -1, "w_end": -1}, ["儿童", "人民","首长", "黑户", "贫民窟"]),
	({"w_attr": 0, "w_end": -1}, ["屁", "卫星", "手套", "半仙", "狗屎", "饲料", "花炮", "游击队", "牛仔裤", "曲辕犁", "热水袋", "原子弹"])
])
